0.57.2119-1/Catalogs/ККСНГ_МашиночитаемыеДоверенности.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ККСНГ_МашиночитаемыеДоверенности</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ККСНГ_Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННДоверителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнформационнаяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоверенностиОснования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПервоначальнойДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяФайлаДоверенности</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФайлДоверенности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьФайлПодписи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлДоверенности</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлПодписи</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Доверители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОГРН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНИЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подписанты</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Полномочия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Текст</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИНН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>9</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОГРН</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>15</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СНИЛС</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>14</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сертификаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отпечаток</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сертификат</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

0.57.2119-1/Catalogs/ККСНГ_МашиночитаемыеДоверенности/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Перем ЗапросДанныеОрганизации;
	
	Если Параметры.Ключ.Пустая() И ЭтотОбъект.Объект.Владелец.Пустая() Тогда
		ВызватьИсключение "Не указана организация ЭДО.";
	КонецЕсли;
	
	ЗапросДанныеОрганизации = ККСНГ_ОбщегоНазначенияВызовСервера.ПолучитьДанныеПоОрганизации(ЭтотОбъект.Объект.Владелец.Организация);
	
	Если ЗапросДанныеОрганизации.Успех И ТипЗнч(ЗапросДанныеОрганизации.Результат) = Тип("Структура") Тогда
		ЭтотОбъект.ОрганизацияИНН = ЗапросДанныеОрганизации.Результат.ИНН;
		ЭтотОбъект.ОрганизацияКПП = ЗапросДанныеОрганизации.Результат.КПП;
		ЭтотОбъект.ОрганизацияОГРН = ЗапросДанныеОрганизации.Результат.ОГРН;
		
		Элементы.Владелец.РасширеннаяПодсказка.Заголовок = ККСНГ_ОбщегоНазначения.ПредставлениеРеквизитовОрганизации(ЭтотОбъект.ОрганизацияИНН, ЭтотОбъект.ОрганизацияКПП, ЭтотОбъект.ОрганизацияОГРН);
		
	КонецЕсли;
	
	ЗаполнитьПодписантовДоверителей();
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ЭтотОбъект.ПериодДействия.ДатаНачала = ТекущийОбъект.ДатаНачала;
	ЭтотОбъект.ПериодДействия.ДатаОкончания = ТекущийОбъект.ДатаОкончания;
	
	Если ТекущийОбъект.ЕстьФайлДоверенности Тогда
		ЭтотОбъект.ХранилищеФайлаДоверенности = ПоместитьВоВременноеХранилище(ТекущийОбъект.ФайлДоверенности.Получить(), ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;
	
	Если ТекущийОбъект.ЕстьФайлПодписи Тогда
		ЭтотОбъект.ХранилищеФайлаПодписи = ПоместитьВоВременноеХранилище(ТекущийОбъект.ФайлПодписи.Получить(), ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;
	
	// Используем только для корректного перечитывания данных
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Перем ДвоичныеДанные;
	
	// Перезаполняем содержимое файлов доверенности и подписи
	ТекущийОбъект.ФайлДоверенности = Неопределено;
	ТекущийОбъект.ФайлПодписи = Неопределено;
	
	Если ЭтотОбъект.Объект.ЕстьФайлДоверенности И ЭтоАдресВременногоХранилища(ЭтотОбъект.ХранилищеФайлаДоверенности) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ЭтотОбъект.ХранилищеФайлаДоверенности);
		ТекущийОбъект.ФайлДоверенности = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.ЕстьФайлПодписи И ЭтоАдресВременногоХранилища(ЭтотОбъект.ХранилищеФайлаПодписи) Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(ЭтотОбъект.ХранилищеФайлаПодписи);
		ТекущийОбъект.ФайлПодписи = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
	КонецЕсли;
	
	// Очистка родительских доверенностей, если они совпадают с текущей
	Если ТекущийОбъект.НомерДоверенностиОснования = ТекущийОбъект.Код Тогда
		ТекущийОбъект.НомерДоверенностиОснования = "";
	КонецЕсли;
	
	Если ТекущийОбъект.НомерПервоначальнойДоверенности = ТекущийОбъект.Код Тогда
		ТекущийОбъект.НомерПервоначальнойДоверенности = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ТекущийОбъект.НомерДоверенностиОснования) И ПустаяСтрока(ТекущийОбъект.НомерПервоначальнойДоверенности) Тогда
		ТекущийОбъект.Родитель = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ККСНГ_МашиночитаемыеДоверенности.ОбновитьИерархиюДоверенностей(ТекущийОбъект.Владелец);
	ЭтотОбъект.Прочитать();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Перем КлючНазначения;
	
	// После выбора родительской доверенности
	КлючНазначения = ИсточникВыбора.КлючНазначенияИспользования;
	Если СтрСравнить(КлючНазначения, "НомерДоверенностиОснования") = 0 Или СтрСравнить(КлючНазначения, "НомерПервоначальнойДоверенности") = 0 Тогда
		ЭтотОбъект.Объект[КлючНазначения] = ПолучитьНомерДоверенностиПоСсылке(ВыбранноеЗначение);
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодДействияПриИзменении(Элемент)
	
	Перем ДатаНачала, ДатаОкончания;
	
	// Если срок действия не указан, то берем 12 месяцев
	Если ЭтотОбъект.ПериодДействия.ДатаНачала <> Дата('00010101') И ЭтотОбъект.ПериодДействия.ДатаОкончания = Дата('00010101') Тогда
		ДатаНачала = ЭтотОбъект.ПериодДействия.ДатаНачала;
		ЭтотОбъект.ПериодДействия.ДатаОкончания = ДобавитьМесяц(НачалоДня(ДатаНачала)-1, 12);
	КонецЕсли;
	
	// Меняем местами дату начала и дату окончания, если пользователь их перепутал
	Если ЭтотОбъект.ПериодДействия.ДатаНачала > ЭтотОбъект.ПериодДействия.ДатаОкончания Тогда
		ДатаНачала = ЭтотОбъект.ПериодДействия.ДатаНачала;
		ДатаОкончания = ЭтотОбъект.ПериодДействия.ДатаОкончания;
		
		ЭтотОбъект.ПериодДействия.ДатаНачала = НачалоДня(ДатаОкончания);
		ЭтотОбъект.ПериодДействия.ДатаОкончания = КонецДня(ДатаНачала);
	КонецЕсли;
	
	// Сохранение значений в реквизиты объекта
	ЭтотОбъект.Объект.ДатаНачала = ЭтотОбъект.ПериодДействия.ДатаНачала;
	ЭтотОбъект.Объект.ДатаОкончания = ЭтотОбъект.ПериодДействия.ДатаОкончания;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерДоверенностиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	Перем ДополнительныеПараметры, ОписаниеОповещения;
	
	// Вопрос пользователю при изменении номера сохраненной доверенности
	Если Не Параметры.Ключ.Пустая() Тогда
		
		СтандартнаяОбработка = Ложь;
		
		// Очищаем поле текс, если содержится значение маски
		Если СтрСравнить(Текст, "00000000-0000-0000-0000-000000000000") = 0 Тогда
			Текст = "";
		КонецЕсли;
		
		ДополнительныеПараметры = Новый Структура;
		ДополнительныеПараметры.Вставить("НовыйНомерДоверенности", Текст);
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ПослеОтветаНаВопросОбИзмененииНомера", ЭтотОбъект, ДополнительныеПараметры);
		ПоказатьВопрос(ОписаниеОповещения, "Доверенность уже сохранена. Изменить номер?", РежимДиалогаВопрос.ДаНет, 0, КодВозвратаДиалога.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоверители

&НаКлиенте
Процедура ДоверителиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле.Имя = "ДоверителиПодписанты" Тогда
		ПоказатьЗначение(, Элемент.ТекущиеДанные.ПодписантыСписок);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьИзФайла(Команда)
	
	Перем МодульФайловаяСистемаКлиент, ОбработчикЗавершения, ПараметрыЗагрузки;
	
	ОчиститьСообщения();
	
	МодульФайловаяСистемаКлиент = ККСНГ_ОбщегоНазначенияКлиентСервер.ОбщийМодуль("ФайловаяСистемаКлиент");
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ВыборФайлаДоверенностиЗавершение", ЭтотОбъект);
	
	ПараметрыЗагрузки = МодульФайловаяСистемаКлиент.ПараметрыЗагрузкиФайла();
	ПараметрыЗагрузки.ИдентификаторФормы = УникальныйИдентификатор;
	ПараметрыЗагрузки.Диалог.Фильтр =  "Архивы и файлы доверенности|*.zip;*.xml";
	ПараметрыЗагрузки.Диалог.Заголовок = "Выберите архив с доверенностью и подписью или XML файл доверенности";
	
	МодульФайловаяСистемаКлиент.ЗагрузитьФайл(ОбработчикЗавершения, ПараметрыЗагрузки);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКСпискуСертификатов(Команда)
	
	Перем ПараметрыОткрытия, ОписаниеОповещенияОЗавершении;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("Сертификаты", ЭтотОбъект.Объект.Сертификаты);
	ПараметрыОткрытия.Вставить("Представители", ЭтотОбъект.Объект.Представители);
	ПараметрыОткрытия.Вставить("СпособАвторизацииОрганизации", ККСНГ_ДокументооборотВызовСервера.СпособАвторизацииОрганизации(ЭтотОбъект.Объект.Владелец));
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("ПослеНастройкиСертификатов", ЭтотОбъект);
	ОткрытьФорму("Справочник.ККСНГ_МашиночитаемыеДоверенности.Форма.ФормаСпискаСертификатов", ПараметрыОткрытия, ЭтотОбъект, , , , ОписаниеОповещенияОЗавершении);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьРодительскуюДоверенность(Команда)
	
	Перем ПараметрыОткрытия;
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("ОрганизацияЭДО", ЭтотОбъект.Объект.Владелец);
	ПараметрыОткрытия.Вставить("РежимВыбора", Истина);
	
	Если СтрСравнить(ЭтотОбъект.ТекущийЭлемент.Имя, "ВыбратьОсновнуюДоверенность") = 0 Тогда
		ПараметрыОткрытия.Вставить("КлючНазначенияИспользования", "НомерДоверенностиОснования");
	ИначеЕсли СтрСравнить(ЭтотОбъект.ТекущийЭлемент.Имя, "ВыбратьПервоначальнуюДоверенность") = 0 Тогда
		ПараметрыОткрытия.Вставить("КлючНазначенияИспользования", "НомерПервоначальнойДоверенности");
	Иначе
		ВызватьИсключение "Нет обработчика для элемента: " + ЭтотОбъект.ТекущийЭлемент.Имя;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.ККСНГ_МашиночитаемыеДоверенности.ФормаВыбора", ПараметрыОткрытия, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлы(Команда)
	
	Перем АдресВременногоХранилища, Файл;
	
	АдресВременногоХранилища = СоздатьАрхивФайлов();
	Если ЭтоАдресВременногоХранилища(АдресВременногоХранилища) Тогда
		Файл = Новый Файл(ЭтотОбъект.Объект.ИмяФайлаДоверенности);
		ПолучитьФайл(АдресВременногоХранилища, Файл.ИмяБезРасширения + ".zip");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СоздатьАрхивФайлов()
	
	Перем ИмяВременногоКаталога, ИмяВременногоФайлаДоверенности, ИмяВременногоФайлаПодписи;
	Перем ДанныеФайла, ЗаписьZip, Результат;
	
	Если Не ЭтотОбъект.Объект.ЕстьФайлДоверенности И Не ЭтотОбъект.Объект.ЕстьФайлПодписи Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ИмяВременногоКаталога = ПолучитьИмяВременногоФайла();
	ИмяВременногоФайлаДоверенности = ИмяВременногоКаталога + "/" + ЭтотОбъект.Объект.ИмяФайлаДоверенности;
	ИмяВременногоФайлаПодписи = ИмяВременногоКаталога + "/" + ЭтотОбъект.Объект.ИмяФайлаДоверенности + ".sig";
	
	СоздатьКаталог(ИмяВременногоКаталога);
	
	Если ЭтотОбъект.Объект.ЕстьФайлДоверенности Тогда
		ДанныеФайла = ПолучитьИзВременногоХранилища(ЭтотОбъект.ХранилищеФайлаДоверенности);
		Если ТипЗнч(ДанныеФайла) = Тип("ДвоичныеДанные") Тогда
			ДанныеФайла.Записать(ИмяВременногоФайлаДоверенности);
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтотОбъект.Объект.ЕстьФайлПодписи Тогда
		ДанныеФайла = ПолучитьИзВременногоХранилища(ЭтотОбъект.ХранилищеФайлаПодписи);
		Если ТипЗнч(ДанныеФайла) = Тип("ДвоичныеДанные") Тогда
			ДанныеФайла.Записать(ИмяВременногоФайлаПодписи);
		КонецЕсли;
	КонецЕсли;
	
	ЗаписьZip = Новый ЗаписьZipФайла;
	ЗаписьZip.Добавить(ИмяВременногоКаталога + "/*.*");
	
	Результат = ПоместитьВоВременноеХранилище(ЗаписьZip.ПолучитьДвоичныеДанные());
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПослеОтветаНаВопросОбИзмененииНомера(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		ЭтотОбъект.Объект.Код = ДополнительныеПараметры.НовыйНомерДоверенности;
		ЭтотОбъект.Модифицированность = Истина;
	КонецЕсли;
	
	ЭтотОбъект.ОбновитьОтображениеДанных();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеНастройкиСертификатов(Результат, ДополнительныеПараметры) Экспорт
	
	Если ТипЗнч(Результат) = Тип("ДанныеФормыКоллекция") Тогда
		ЗаполнитьТаблицуСертификатов(Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуСертификатов(Сертификаты)
	
	ЭтотОбъект.Объект.Сертификаты.Загрузить(Сертификаты.Выгрузить());
	ЭтотОбъект.Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаДоверенностиЗавершение(ПомещенныйФайл, ДополнительныеПараметры) Экспорт
	
	Если ПомещенныйФайл <> Неопределено Тогда
		ПрочитатьФайлДоверенностиИПодписи(ПомещенныйФайл.Хранение);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПрочитатьФайлДоверенностиИПодписи(АдресВоВременномХранилище)
	
	Перем Ответ;
	Перем ЗаполнениеДоверенности, ДоверенностьОбъект;
	Перем ДвоичныеДанные, Объект, ДанныеФайла;
	
	Ответ = ККСНГ_ОбщегоНазначенияКлиентСервер.ПолучитьСтруктуруОтвета();
	
	Если ЭтоАдресВременногоХранилища(АдресВоВременномХранилище) Тогда
		ДанныеФайла = ПолучитьИзВременногоХранилища(АдресВоВременномХранилище);
	Иначе
		ККСНГ_ЛогированиеКлиентСервер.ДобавитьОшибку(Ответ.Журнал, "Ошибка получения данных машиночитаемой доверенности", "MCHD-00013");
		Возврат;
	КонецЕсли;
	
	ЗаполнениеДоверенности = ККСНГ_МашиночитаемыеДоверенности.ПолучитьСведенияОДоверенностиИПодписи(ДанныеФайла);
	ККСНГ_ЛогированиеКлиентСервер.КонкатенироватьЖурналы(Ответ.Журнал, ЗаполнениеДоверенности.Журнал);
	
	Если Не ЗаполнениеДоверенности.Успех Тогда
		ККСНГ_ЛогированиеКлиентСервер.ВывестиПоследнююОшибкуЖурнала(Ответ.Журнал);
		Возврат;
	КонецЕсли;
	
	ДоверенностьОбъект = ЗаполнениеДоверенности.Результат;
	ЗаполнитьОбъект(ДоверенностьОбъект);
	
	// Перезаполним файл доверенности
	Если ЭтоАдресВременногоХранилища(ЭтотОбъект.ХранилищеФайлаДоверенности) Тогда
		УдалитьИзВременногоХранилища(ЭтотОбъект.ХранилищеФайлаДоверенности);
		ЭтотОбъект.ХранилищеФайлаДоверенности = "";
	КонецЕсли;
	
	Если ДоверенностьОбъект.ЕстьФайлДоверенности Тогда
		ДвоичныеДанные = ДоверенностьОбъект.ФайлДоверенности.Получить();
		ЭтотОбъект.ХранилищеФайлаДоверенности = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;
	
	// Перезаполним файл подписи
	Если ЭтоАдресВременногоХранилища(ЭтотОбъект.ХранилищеФайлаПодписи) Тогда
		УдалитьИзВременногоХранилища(ЭтотОбъект.ХранилищеФайлаПодписи);
		ЭтотОбъект.ХранилищеФайлаПодписи = "";
	КонецЕсли;
	
	Если ДоверенностьОбъект.ЕстьФайлПодписи Тогда
		ДвоичныеДанные = ДоверенностьОбъект.ФайлПодписи.Получить();
		ЭтотОбъект.ХранилищеФайлаПодписи = ПоместитьВоВременноеХранилище(ДвоичныеДанные, ЭтотОбъект.УникальныйИдентификатор);
	КонецЕсли;
	
	// Заполняем переиод действия доверенности
	ЭтотОбъект.ПериодДействия.ДатаНачала = ЭтотОбъект.Объект.ДатаНачала;
	ЭтотОбъект.ПериодДействия.ДатаОкончания = ЭтотОбъект.Объект.ДатаОкончания;
	
	ЗаполнитьПодписантовДоверителей();
	
	ЭтотОбъект.Модифицированность = Истина;
	
	ОбновитьОтображениеЭлементовФормы();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОбъект(ДоверенностьОбъект)
	
	Перем Объект;
	Перем Доверитель, Представитель, Полномочие, НоваяСтрока;
	
	Объект = РеквизитФормыВЗначение("Объект");
	ЗаполнитьЗначенияСвойств(Объект, ДоверенностьОбъект, , "Владелец, Ссылка");
	
	Объект.ФайлДоверенности = Новый ХранилищеЗначения(ДоверенностьОбъект.ФайлДоверенности.Получить(), Новый СжатиеДанных(9));
	Объект.ФайлПодписи = Новый ХранилищеЗначения(ДоверенностьОбъект.ФайлПодписи.Получить(), Новый СжатиеДанных(9));
	
	Объект.Доверители.Очистить();
	Для каждого Доверитель Из ДоверенностьОбъект.Доверители Цикл
		НоваяСтрока = Объект.Доверители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Доверитель);
	КонецЦикла;
	
	Объект.Представители.Очистить();
	Для каждого Представитель Из ДоверенностьОбъект.Представители Цикл
		НоваяСтрока = Объект.Представители.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Представитель);
	КонецЦикла;
	
	Объект.Полномочия.Очистить();
	Для каждого Полномочие Из ДоверенностьОбъект.Полномочия Цикл
		НоваяСтрока = Объект.Полномочия.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Полномочие);
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(Объект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОтображениеЭлементовФормы()
	
	Элементы.Доверенность.ТолькоПросмотр = ЭтотОбъект.Объект.ЕстьФайлДоверенности;
	Элементы.ВыбратьОсновнуюДоверенность.Доступность = Не Элементы.Доверенность.ТолькоПросмотр;
	Элементы.ВыбратьПервоначальнуюДоверенность.Доступность = Не Элементы.Доверенность.ТолькоПросмотр;
	
	Элементы.СохранитьФайлы.Доступность = ЭтотОбъект.Объект.ЕстьФайлДоверенности;
	
	ОбновитьИкнокиСтатусовДоверенности();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодписантовДоверителей()
	
	Перем Доверитель, Наименование, Подписант, Подписанты;
	
	Для каждого Доверитель Из ЭтотОбъект.Объект.Доверители Цикл
		
		Доверитель.ПодписантыСписок.Очистить();
		
		Если Не ПустаяСтрока(Доверитель.Подписанты) Тогда
			
			Подписанты = ККСНГ_ОбщегоНазначения.ДанныеИзJSON(Доверитель.Подписанты);
			Если ТипЗнч(Подписанты) = Тип("Массив") Тогда
				Для каждого Подписант Из Подписанты Цикл
					Наименование = ККСНГ_ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Подписант, "Наименование");
					Если Не ПустаяСтрока(Наименование) Тогда
						Доверитель.ПодписантыСписок.Добавить(Наименование);
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьИкнокиСтатусовДоверенности()
	
	Перем Доверитель;
	
	// Установка общей картинки страницы доверители
	Элементы.ГруппаДоверители.Картинка = ?(ЭтотОбъект.Объект.Доверители.Количество() = 0, Новый Картинка, БиблиотекаКартинок.ККСНГ_Предупреждение);
	
	// Установка картинки по каждому доверителю
	Для каждого Доверитель Из ЭтотОбъект.Объект.Доверители Цикл
		
		Если Доверитель.ИНН = ЭтотОбъект.ОрганизацияИНН И Доверитель.КПП = ЭтотОбъект.ОрганизацияКПП И Доверитель.ОГРН = ЭтотОбъект.ОрганизацияОГРН Тогда
			Доверитель.Картинка = 1; // Картинка флажка
			Элементы.ГруппаДоверители.Картинка = БиблиотекаКартинок.ОформлениеФлажок;
		Иначе
			Доверитель.Картинка = 2; // Картинка предупреждения
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьНомерДоверенностиПоСсылке(СсылкаДоверенность)
	
	Возврат ККСНГ_ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СсылкаДоверенность, "Код", Истина);
	
КонецФункции

#КонецОбласти
